Revit 2027 API
ParameterTypeId.SteelElemPatternTotalLength Property
 "Length on side 1"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemPatternTotalLength { get; }
Public Shared ReadOnly Property SteelElemPatternTotalLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemPatternTotalLength {
	ForgeTypeId^ get ();
}
static member SteelElemPatternTotalLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace